# Regiment

### Introduction:

Special thanks to: http://chrisalbon.com/ for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Create the DataFrame with the following values:

In [3]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 3. Assign it to a variable called regiment.
#### Don't forget to name each column

In [4]:
regiment = pd.DataFrame(raw_data)

### Step 4. What is the mean preTestScore from the regiment Nighthawks?

In [56]:
regiment[regiment['regiment']=='Nighthawks'].groupby('regiment').agg(
    mean_preTestScore = ('preTestScore', 'mean')
)

            mean_preTestScore
regiment
Nighthawks              15.25

### Step 5. Present general statistics by company

In [60]:
regiment['company'].describe()

count      12
unique      2
top       1st
freq        6
Name: company, dtype: object

In [68]:
regiment.groupby('company')[['preTestScore', 'postTestScore']].agg(['mean', 'min', 'max', 'std'])

        preTestScore                    postTestScore
                mean min max        std          mean min max        std
company
1st         6.666667   2  24   8.524475     57.666667  25  94  27.485754
2nd        15.500000   2  31  14.652645     67.000000  57  94  14.057027

### Step 6. What is the mean of each company's preTestScore?

In [80]:
regiment.groupby('company')['preTestScore'].agg(['mean'])

              mean
company
1st       6.666667
2nd      15.500000

### Step 7. Present the mean preTestScores grouped by regiment and company

In [81]:
regiment.groupby(['regiment', 'company'])['preTestScore'].agg(['mean'])

                    mean
regiment   company
Dragoons   1st       3.5
           2nd      27.5
Nighthawks 1st      14.0
           2nd      16.5
Scouts     1st       2.5
           2nd       2.5

### Step 8. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

In [89]:
regiment.groupby(['regiment', 'company'], as_index=False)['preTestScore'].agg(['mean'])

     regiment company  mean
0    Dragoons     1st   3.5
1    Dragoons     2nd  27.5
2  Nighthawks     1st  14.0
3  Nighthawks     2nd  16.5
4      Scouts     1st   2.5
5      Scouts     2nd   2.5

### Step 9. Group the entire dataframe by regiment and company

In [101]:
grouped = regiment.groupby(['regiment', 'company'])

### Step 10. What is the number of observations in each regiment and company

In [111]:
grouped = regiment.groupby(['regiment', 'company']).size()
grouped

regiment    company
Dragoons    1st        2
            2nd        2
Nighthawks  1st        2
            2nd        2
Scouts      1st        2
            2nd        2
dtype: int64

### Step 11. Iterate over a group and print the name and the whole data from the regiment

In [116]:
grouped = regiment.groupby('regiment')
for name, group in grouped['regiment']:
    print(name)
    print(group)

Dragoons
4    Dragoons
5    Dragoons
6    Dragoons
7    Dragoons
Name: regiment, dtype: object
Nighthawks
0    Nighthawks
1    Nighthawks
2    Nighthawks
3    Nighthawks
Name: regiment, dtype: object
Scouts
8     Scouts
9     Scouts
10    Scouts
11    Scouts
Name: regiment, dtype: object